[
   {
      "q": "Select the deductive debugging process steps from the lists.",
      "c": [
         "Use elimination process",
         "Prove remaining hypothesis",
         "Enumerate possible causes",
         "Refine remaining hypothesis",
         "Collect more data",
         "Fix the error"
      ],
      "a": [
         "Enumerate possible causes",
         "Use elimination process",
         "Refine remaining hypothesis",
         "Prove remaining hypothesis",
         "Fix the error",
         "Collect more data"
      ]
   },
   {
      "q": "Indicate if the following statements about module testing is true or false. Test cases are supplemented by applying black-box methods to the module's specification.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Indicate if the following statements about module testing is true or false. Module's logic is analyzed using the white-box methods.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "The only rule in top-down testing is that when selecting the next module for testing, it must be eligible to be the next module, with at least one of the module's subordinate (calling) modules previously tested.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which type of tester focuses exclusively on validating the interactions and behaviors that result in functionality?",
      "c": [
         "Black-box tester",
         "White-box tester",
         "Gray-box tester",
         "Usability tester"
      ],
      "a": [
         "White-box tester"
      ]
   },
   {
      "q": "What is the best way to document and keep track of test cases?",
      "c": [
         "A set of detailed text files",
         "A detailed spreadsheet",
         "A bug tracking system",
         "A test case management system"
      ],
      "a": [
         "A test case management system"
      ]
   },
   {
      "q": "Occurs when the number of received parameters are not equal to the number of sent arguments",
      "c": [
         "Interface",
         "Data reference",
         "Computation",
         "Data declaration",
         "Input/Output"
      ],
      "a": [
         "Interface"
      ]
   },
   {
      "q": "Requires the user to make changes in the program, which could lead to masking of errors, and so on",
      "c": [
         "Automated tools",
         "Scatter print statements",
         "Storage dump"
      ],
      "a": [
         "Scatter print statements"
      ]
   },
   {
      "q": "Which test requires the organization that produced the program to create the test cases?",
      "c": [
         "Integration test",
         "Installation test",
         "System test",
         "Function test"
      ],
      "a": [
         "Installation test"
      ]
   },
   {
      "q": "Which statement matches the transaction section of the business layer testing area.",
      "c": [
         "Tests to detect errors in knowledge collected from customers",
         "Tests to uncover errors in transaction processing, such as credit card processing, e-mailing verification's, and so on",
         "Tests whether the application meets documented operational specifications"
      ],
      "a": [
         "Tests to uncover errors in transaction processing, such as credit card processing, e-mailing verification's, and so on"
      ]
   },
   {
      "q": "Which test case design technique is based on writing test cases around probable types of errors?",
      "c": [
         "Identifying equivalence classes",
         "Cause-effect graphing",
         "Boundary value analysis",
         "Error guessing"
      ],
      "a": [
         "Error guessing"
      ]
   },
   {
      "q": "What is an advantage of incremental testing?",
      "c": [
         "Labor costs are smaller",
         "Provides opportunities for parallel activities",
         "Programming errors are detected earlier",
         "It uses less machine time"
      ],
      "a": [
         "Programming errors are detected earlier"
      ]
   },
   {
      "q": "What must a black-box tester focus on?",
      "c": [
         "Knowledge at the source code level",
         "How each individual piece of the application works",
         "Expected outputs of the program, but not every input",
         "What a program is supposed to do and who it is for"
      ],
      "a": [
         "What a program is supposed to do and who it is for"
      ]
   },
   {
      "q": "Which statement matches the Data validation section of the business layer testing area.",
      "c": [
         "Tests to detect errors in knowledge collected from customers",
         "Tests to uncover errors in transaction processing, such as credit card processing, e-mailing verifications, and so on",
         "Tests whether the application meets documented operational specifications"
      ],
      "a": [
         "Tests to detect errors in knowledge collected from customers"
      ]
   },
   {
      "q": "______ is a test case design technique that produces test cases based on intuitive and expert knowledge of test team members for defining potential software errors and facilitating efficient test case design.",
      "c": [
         "Cause-effect graphing",
         "Logic coverage",
         "Error guessing"
      ],
      "a": [
         "Error guessing"
      ]
   },
   {
      "q": "Select the categories of the completion criteria.",
      "c": [
         "Base completion on the use of specific test-case design methodologies",
         "Stop after the scheduled time for testing expires.",
         "Examine the curve of number of errors found per unit time during the test phase",
         "Stop when the test cases are successful",
         "State the completion requirements in positive terms"
      ],
      "a": [
         "Base completion on the use of specific test-case design methodologies",
         "Examine the curve of number of errors found per unit time during the test phase",
         "State the completion requirements in positive terms"
      ]
   },
   {
      "q": "Which Agile methodology matches this statement:<P>Adapts RUP in which user choose the practices, such as use cases or team programming that fits the project",
      "c": [
         "Feature driven development",
         "Velocity tracking",
         "Essential unified process",
         "Dynamic system development method"
      ],
      "a": [
         "Essential unified process"
      ]
   },
   {
      "q": "Which of the following is a brute-force debugging technique?",
      "c": [
         "Process of elimination",
         "Studying error symptoms",
         "Dumping memory locations",
         "Backtracking"
      ],
      "a": [
         "Dumping memory locations"
      ]
   },
   {
      "q": "Select the descriptions that as associated with Installation testing. (choose two)",
      "c": [
         "It compares the initial requirements of the program to its end user current needs.",
         "It checks test cases to ensure that compatible set of options have been selected.",
         "It is performed by the program's customer or end user.",
         "Its test cases are developed by the organization that produced the system."
      ],
      "a": [
         "It checks test cases to ensure that compatible set of options have been selected.",
         "Its test cases are developed by the organization that produced the system."
      ]
   },
   {
      "q": "Which debugging method looks at a reverse execution of the program?",
      "c": [
         "Debugging by backtracking",
         "Debugging by deduction",
         "Debugging by testing",
         "Brute-force debugging"
      ],
      "a": [
         "Debugging by backtracking"
      ]
   },
   {
      "q": "Involves execution of all the executable statements in the source code at least once",
      "c": [
         "Multiple-Condition",
         "Statement",
         "Decision",
         "Condition",
         "Descision/condition"
      ],
      "a": [
         "Statement"
      ]
   },
   {
      "q": "Code-level tests that are concerned with the interaction between objects are best created by the _________.",
      "c": [
         "developer",
         "black-box tester",
         "project manager",
         "white-box engineer"
      ],
      "a": [
         "white-box engineer"
      ]
   },
   {
      "q": "Select the description that matches the testing challenge for an internet based application facing a Security challenge.",
      "c": [
         "Includes protection of information such as customers' credit card from hackers",
         "Includes cost related issues and tracking customer profiles",
         "Includes internationalization issues such as currency conversion"
      ],
      "a": [
         "Includes protection of information such as customers' credit card from hackers"
      ]
   },
   {
      "q": "What is the most important consideration when deciding on a bug base?",
      "c": [
         "It is simple and intuitive so users can easily report bugs",
         "The cost is within your budget",
         "It makes use of spreadsheets for proper tracking",
         "It connects with your test case management system"
      ],
      "a": [
         "It is simple and intuitive so users can easily report bugs"
      ]
   },
   {
      "q": "Usability testing is also called user acceptance testing.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "True or False: Test cases must be written for input conditions that are invalid and unexpected, as well as for those that are valid and expected.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the statements that match the Extreme acceptance testing type (choose two)",
      "c": [
         "All code modules must have primary tests before coding begins.",
         "Customers creates test cases during the design/planning phases.",
         "It determines whether the application meets its functional and usable requirements.",
         "The primary tests must be defined and created before coding the module."
      ],
      "a": [
         "It determines whether the application meets its functional and usable requirements.",
         "Customers creates test cases during the design/planning phases."
      ]
   },
   {
      "q": "Indicate if the given statements about error-locating principles is true or false.",
      "c": [
         "Talk about the problem with someone else to discover the solution."
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the error-reporting techniques (choose three)",
      "c": [
         "Fix the complete error, not just one of its symptom.",
         "Code inspection is done by the project analyst after implementing an error correction.",
         "Probability of fixes being correct must be made directly proportional to the size of the code.",
         "Error corrections must be well tested in the original program.",
         "Monitor all parts which are nearby to the place of detected error."
      ],
      "a": [
         "Fix the complete error, not just one of its symptom.",
         "Error corrections must be well tested in the original program.",
         "Monitor all parts which are nearby to the place of detected error."
      ]
   },
   {
      "q": "Indicate if the given statements about agile testing is true or false.<P>It relies on automated testing because the development cycles are long.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Videotaping a user test and using a think-aloud protocol can provide excellent data on software usability and user perceptions about the application.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Testing each module independently and then combining the modules to form the program is called nonincremental testing.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the correct description of the appropriate testing tiers for the business layer",
      "c": [
         "Verifies that the data is stored correctly and accurately.",
         "Verifies that graphics have the correct resolution and size.",
         "Ensures that data is collected correctly."
      ],
      "a": [
         "Ensures that data is collected correctly."
      ]
   },
   {
      "q": "True or False: A bug base is a system for keeping track of every bug logged in a database system.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Identify the testing processes that make up the Function test part of the development phase",
      "c": [
         "Code: It produces the code for the required program.",
         "Requirement: It specifies the cause of the program.",
         "External specification: It defines the exact representation of the program to users.",
         "System design: It lays down the design principles of the system."
      ],
      "a": [
         "External specification: It defines the exact representation of the program to users."
      ]
   },
   {
      "q": "Comes when calculations among variables include inconsistent data",
      "c": [
         "Interface",
         "Data reference",
         "Computation",
         "Data declaration",
         "Input/Output"
      ],
      "a": [
         "Computation"
      ]
   },
   {
      "q": "During a code inspection the moderator narrates, statement by statement, the logic of the program.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Which area of an application is being tested when a tester confirms that all links point to valid files or websites?",
      "c": [
         "Business",
         "Browser",
         "Data",
         "Presentation"
      ],
      "a": [
         "Presentation"
      ]
   },
   {
      "q": "Select the statements that match Top-down testing. (choose two)",
      "c": [
         "Creates test conditions and concludes test results easily",
         "Conducts testing from main module to sub module",
         "Finds difficulty in test case representation in stubs, before the I/O function addition",
         "Conducts testing from sub module to main module"
      ],
      "a": [
         "Finds difficulty in test case representation in stubs, before the I/O function addition",
         "Conducts testing from main module to sub module"
      ]
   },
   {
      "q": "Indicate if given statement about presentation layer testing is true or false<P>It consists of finding errors in the GUI, or front end, of an application.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the descriptions that as associated with Acceptance testing. (choose two)",
      "c": [
         "It is performed by the program's customer or end user.",
         "It compares the initial requirements of the program to its end user current needs.",
         "Its test cases are developed by the organization that produced the system.",
         "It checks test cases to ensure that compatible set of options have been selected."
      ],
      "a": [
         "It compares the initial requirements of the program to its end user current needs.",
         "It is performed by the program's customer or end user."
      ]
   },
   {
      "q": "Which test will show that a program does not match its external specifications?",
      "c": [
         "Function test",
         "Module test",
         "Acceptance test",
         "System test"
      ],
      "a": [
         "Function test"
      ]
   },
   {
      "q": "Which step in the software development process translates requirements into specific objectives?",
      "c": [
         "External specifications",
         "Requirements",
         "Objectives",
         "System design"
      ],
      "a": [
         "Objectives"
      ]
   },
   {
      "q": "Arises if all the used files are not opened and closed after use",
      "c": [
         "Interface",
         "Data reference",
         "Computation",
         "Data declaration",
         "Input/Output"
      ],
      "a": [
         "Input/Output"
      ]
   },
   {
      "q": "Indicate if given statement about presentation layer testing is true or false<P>It involves checking the human-interface element of a website.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Checks that each state in a decision in the program takes all possible outcomes at least once",
      "c": [
         "Decision",
         "Multiple-Condition",
         "Descision/condition",
         "Statement",
         "Condition"
      ],
      "a": [
         "Condition"
      ]
   },
   {
      "q": "Select the description that matches the e-commerce architecture tier for tier 3:",
      "c": [
         "Provides the visual content to the end user",
         "Focuses on storing and retrieving data from the data source",
         "Runs the software to model user business processes"
      ],
      "a": [
         "Focuses on storing and retrieving data from the data source"
      ]
   },
   {
      "q": "True or False: When the testing is focused on how the application behaves at a code level, a white-box tester should create the tests.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Indicate if the given statements about error-locating principles is true or false.<P>Keep debugging tools on the first priority.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Select the possibilities of carrier's web proxy or transcoder.",
      "c": [
         "Encryption of traffic for privacy and security",
         "Data compression for better throughput",
         "Access obstruction to certain high-bandwidth sites",
         "HTML headers and other metadata exclusion from Web pages that an application might use",
         "Transformation or transcode of content into WAP or HTTP",
         "Transformation or transcode of content into FTP"
      ],
      "a": [
         "Encryption of traffic for privacy and security",
         "Data compression for better throughput",
         "Access obstruction to certain high-bandwidth sites",
         "HTML headers and other metadata exclusion from Web pages that an application might use",
         "Transformation or transcode of content into WAP or HTTP"
      ]
   },
   {
      "q": "Evaluates each decision for all the combinations of conditions",
      "c": [
         "Multiple-Condition",
         "Decision",
         "Statement",
         "Descision/condition",
         "Condition"
      ],
      "a": [
         "Multiple-Condition"
      ]
   },
   {
      "q": "What key best practice brings the development process together in order to meet the deliverable deadline?",
      "c": [
         "Not wasting time on trivial items that have no impact",
         "Racing ahead with your eyes focused on the finish line",
         "Having clearly defined goals for every milestone",
         "Making hard decisions regarding the direction of development"
      ],
      "a": [
         "Having clearly defined goals for every milestone"
      ]
   },
   {
      "q": "Indicate if the following statements about module testing is true or false. Only the module specifications are required while designing the module test cases.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "What type of test compares the program to its initial requirements and the current needs of its end users?",
      "c": [
         "Function test",
         "Regression test",
         "Unit test",
         "Acceptance test"
      ],
      "a": [
         "Acceptance test"
      ]
   },
   {
      "q": "Follows that every condition in a decision and every decision in the program takes all possible outcomes at least once",
      "c": [
         "Statement",
         "Descision/condition",
         "Multiple-Condition",
         "Condition",
         "Decision"
      ],
      "a": [
         "Descision/condition"
      ]
   },
   {
      "q": "What is an advantage to using an emulator when device testing?",
      "c": [
         "It can test the responsiveness of an application",
         "It can identify device-specific bugs",
         "It is cost-effective",
         "It can test the code base once"
      ],
      "a": [
         "It is cost-effective"
      ]
   },
   {
      "q": "What is the key to successful higher-order testing?",
      "c": [
         "Acceptance testing",
         "Function testing that uncovers errors",
         "Appropriate system testing",
         "Consistent and well-planned testing"
      ],
      "a": [
         "Consistent and well-planned testing"
      ]
   },
   {
      "q": "Usability testing involves actual users or customers of the product.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which layer of an internet application houses data used by the application or collected from the end user?",
      "c": [
         "Browser",
         "Data",
         "Business",
         "Presentation"
      ],
      "a": [
         "Data"
      ]
   },
   {
      "q": "True or False: The goal of automation is to completely eliminate the need for a human to participate in the testing process.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Which duty is a responsibility of the code inspection team moderator?",
      "c": [
         "Ensuring that all errors found are fixed during the inspection",
         "Selecting the team members",
         "Assigning someone to schedule the inspection",
         "Recording all errors found"
      ],
      "a": [
         "Recording all errors found"
      ]
   },
   {
      "q": "True or False: A bug matrix is used to identify the issues that do not require a developer's attention.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Which test case methodology should be used for a specification that contains combinations of input conditions?",
      "c": [
         "Boundary value analysis",
         "Condition coverage",
         "Cause-effect graphing",
         "Error guessing"
      ],
      "a": [
         "Cause-effect graphing"
      ]
   },
   {
      "q": "True or False: In white-box testing, the tester is not concerned about the internal behavior and structure of a program.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Select the description that matches the e-commerce architecture tier for tier 1:",
      "c": [
         "Focuses on storing and retrieving data from the data source",
         "Provides the visual content to the end user",
         "Runs the software to model user business processes"
      ],
      "a": [
         "Provides the visual content to the end user"
      ]
   },
   {
      "q": "Which type of test would reveal that the program as a whole either meets or doesn't meet its objectives?",
      "c": [
         "Function test",
         "System test",
         "Acceptance test",
         "Integration test"
      ],
      "a": [
         "System test"
      ]
   },
   {
      "q": "Select the descriptions that match Desk Checking",
      "c": [
         "Runs counter to testing principle two, which states that people are generally ineffective in testing their own programs",
         "Follows undisciplined process of testing and finding errors",
         "Evaluates anonymous programs for their overall quality, maintainability, and so on",
         "Selects a programmer to serve as the administrator of a process"
      ],
      "a": [
         "Runs counter to testing principle two, which states that people are generally ineffective in testing their own programs",
         "Follows undisciplined process of testing and finding errors"
      ]
   },
   {
      "q": "It provides the entry point into the application.",
      "c": [
         "main()",
         "primeCheck()",
         "assertFalse()",
         "checkArgs()"
      ],
      "a": [
         "main()"
      ]
   },
   {
      "q": "Describe Black-box testing (pick two)",
      "c": [
         "Requires programming and implementation knowledge",
         "Exhaustive path testing is one of its type of testing technique",
         "Exhaustive input testing is one of its type of testing technique",
         "Internal structure or design implementation is not known to the tester"
      ],
      "a": [
         "Internal structure or design implementation is not known to the tester",
         "Exhaustive input testing is one of its type of testing technique"
      ]
   },
   {
      "q": "The most important consideration in program testing is the design and creation of effective test cases.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which technique is used to evaluate anonymous programs in terms of their overall quality, maintainability, extensibility, usability, and clarity?",
      "c": [
         "Code walkthroughs",
         "Peer ratings",
         "Code inspections",
         "Desk checking"
      ],
      "a": [
         "Peer ratings"
      ]
   },
   {
      "q": "Select the functionalities associated with the business layer. (choose four)",
      "c": [
         "User authentication",
         "Data verification",
         "Transaction processing",
         "User authorizing",
         "Application logging",
         "Data validation"
      ],
      "a": [
         "Transaction processing",
         "User authorizing",
         "Application logging",
         "Data validation"
      ]
   },
   {
      "q": "Is the given statements about testing with emulator is true or false:<P>Its underlying hardware might skew performance on real device.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "The business layer models processes, such as user authentication and transactions.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which step in the software development process defines the exact representation of the program to users?",
      "c": [
         "External specifications",
         "System design",
         "Requirements",
         "Program structure design"
      ],
      "a": [
         "External specifications"
      ]
   },
   {
      "q": "What does it mean to raise the reliability of a program?",
      "c": [
         "To demonstrate that errors are not present",
         "To find and remove errors",
         "To show that a program performs its intended functions",
         "To establish confidence that a program does what it is supposed to do"
      ],
      "a": [
         "To find and remove errors"
      ]
   },
   {
      "q": "If you want your application to run without any abnormal terminations, which bug type would be ranked most important to fix?",
      "c": [
         "Performance",
         "Incorrectly functioning with a workaround",
         "Crash",
         "Cosmetic"
      ],
      "a": [
         "Crash"
      ]
   },
   {
      "q": "It checks the input value against a calculated list of numbers divisible only by itself and 1.",
      "c": [
         "primeCheck()",
         "assertFalse()",
         "checkArgs()",
         "main()"
      ],
      "a": [
         "primeCheck()"
      ]
   },
   {
      "q": "Is the given statements about inspections and walkthroughs in software testing, true or false.<P>They are code-oriented human testing methods.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which black-box methodology focuses on finding a subset of all possible inputs with the highest probability of finding the most errors?",
      "c": [
         "Equivalence partitioning",
         "Identifying equivalence classes",
         "Cause-effect graphing",
         "Boundary value analysis"
      ],
      "a": [
         "Equivalence partitioning"
      ]
   },
   {
      "q": "Select the statements that match the Backtracking testing method. (choose two)",
      "c": [
         "It starts from the suspected site, and then traces in opposite direction in entire source code.",
         "It is effective in case of small applications.",
         "It provides information useful in locating a suspected error."
      ],
      "a": [
         "It starts from the suspected site, and then traces in opposite direction in entire source code.",
         "It is effective in case of small applications."
      ]
   },
   {
      "q": "Select the description that matches the Usability test case.",
      "c": [
         "Subjects the program to heavy loads of data",
         "Checks if the program meets response and throughput requirements",
         "Determines how well an end user can interact with the program",
         "Ensures functionality to be implemented in the objectives"
      ],
      "a": [
         "Determines how well an end user can interact with the program"
      ]
   },
   {
      "q": "Select the statements that match the testing approach for a real device. (choose two)",
      "c": [
         "Supports multiple devices with a single unit",
         "Tests responsiveness of the application",
         "Skews performance on real device due to underlying hardware",
         "Tests carriers' network responsiveness"
      ],
      "a": [
         "Tests responsiveness of the application",
         "Tests carriers' network responsiveness"
      ]
   },
   {
      "q": "Select the correct description of the appropriate testing tier for the presentation layer",
      "c": [
         "Ensures that data is collected correctly.",
         "Verifies that the data is stored correctly and accurately.",
         "Verifies that graphics have the correct resolution and size."
      ],
      "a": [
         "Verifies that graphics have the correct resolution and size."
      ]
   },
   {
      "q": "Debugging by brute force is both efficient and successful.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Select the description that matches the testing challenge for an internet based application facing a Locales challenge.",
      "c": [
         "Includes cost related issues and tracking customer profiles",
         "Includes internationalization issues such as currency conversion",
         "Includes protection of information such as customers' credit card from hackers"
      ],
      "a": [
         "Includes internationalization issues such as currency conversion"
      ]
   },
   {
      "q": "Shows the program state at only one instant of time for error detection and for studying the program dynamics",
      "c": [
         "Scatter print statements",
         "Automated tools",
         "Storage dump"
      ],
      "a": [
         "Storage dump"
      ]
   },
   {
      "q": "What type of module testing includes strategies such as top-down and bottom-up?",
      "c": [
         "Incremental integration",
         "Coverage testing",
         "Big-bang testing",
         "Non-incremental testing"
      ],
      "a": [
         "Incremental integration"
      ]
   },
   {
      "q": "Which form of testing involves everyone in the process through the design, implementation, and execution of the test plan?",
      "c": [
         "Testing and retesting the code base",
         "Continuous testing",
         "Extreme program testing",
         "Agile testing"
      ],
      "a": [
         "Agile testing"
      ]
   },
   {
      "q": "Provides excellent data on software usability and user perceptions about the application",
      "c": [
         "Think-aloud",
         "Eye tracking"
      ],
      "a": [
         "Think-aloud"
      ]
   },
   {
      "q": "Which test type will satisfy the final validation and verification criteria?",
      "c": [
         "Systems Validation",
         "Functional testing",
         "Acceptance testing",
         "Packaging and delivery"
      ],
      "a": [
         "Acceptance testing"
      ]
   },
   {
      "q": "Select the correct black box testing type. Shows the connection between a given outcome and all issues that manipulate the outcome.",
      "c": [
         "Boundary value analysis",
         "Cause-effect graphing",
         "Equivalence partitioning"
      ],
      "a": [
         "Cause-effect graphing"
      ]
   },
   {
      "q": "Indicate if the given statements about error-locating principles is true or false.<BR>Involve a mental analysis of the information associated with the error's symptoms.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the statements that match the Extreme unit testing type (choose two)",
      "c": [
         "All code modules must have primary tests before coding begins.",
         "The primary tests must be defined and created before coding the module.",
         "Customers creates test cases during the design/planning phases.",
         "It determines whether the application meets its functional and usable requirements."
      ],
      "a": [
         "All code modules must have primary tests before coding begins.",
         "The primary tests must be defined and created before coding the module."
      ]
   },
   {
      "q": "Is the given statements about system testing is true or false. It falls under the category of black box testing.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "A testing best practice is for the _____________ to create a unit test.",
      "c": [
         "developer",
         "white-box engineer",
         "black-box tester",
         "project manager"
      ],
      "a": [
         "developer"
      ]
   },
   {
      "q": "When is the appropriate time to include the people responsible for quality in the development cycle?",
      "c": [
         "As early as possible in the cycle",
         "When coding begins",
         "When requirements are formulated",
         "When formal testing begins"
      ],
      "a": [
         "As early as possible in the cycle"
      ]
   },
   {
      "q": "Indicate if the following statement about Jakob Nielsen's usability research is true or false:<P>It depicts that incurring extra cost and complexity of working with many testers for an application check is not required.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which of the following is a key principle of testing?",
      "c": [
         "Testing requires dependence on develoeprs",
         "Complete testing is not possible",
         "Formal exit criteria,must be defined",
         "Testing does not need to be planned"
      ],
      "a": [
         "Complete testing is not possible"
      ]
   },
   {
      "q": "Which Agile methodology matches this statement: <P>Uses an iterative and incremental approach, with the goal of delivering software on time",
      "c": [
         "Essential unified process",
         "Dynamic system development method",
         "Feature driven development",
         "Velocity tracking"
      ],
      "a": [
         "Dynamic system development method"
      ]
   },
   {
      "q": "Select the description that matches the Facility test case.",
      "c": [
         "Subjects the program to heavy loads of data",
         "Ensures functionality to be implemented in the objectives",
         "Checks if the program meets response and throughput requirements",
         "Determines how well an end user can interact with the program"
      ],
      "a": [
         "Ensures functionality to be implemented in the objectives"
      ]
   },
   {
      "q": "Requirements translate the program user's needs and specify why the program is needed.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "What is the benefit of building a discrete list of defects and ranking them in order of importance?",
      "c": [
         "Helping to define the severity of each issue",
         "Creating an opportunity to examine quality goals and how defects affect the milestone schedule",
         "Allowing for performance issues to be identified and elevated to the top of the list",
         "Giving the team the opportunity to voice their concerns and advocate for their own priorities"
      ],
      "a": [
         "Giving the team the opportunity to voice their concerns and advocate for their own priorities"
      ]
   },
   {
      "q": "Sets breakpoints that causes suspension in the program so that the programmer can examine the current state of the program",
      "c": [
         "Automated tools",
         "Storage dump",
         "Scatter print statements"
      ],
      "a": [
         "Automated tools"
      ]
   },
   {
      "q": "True or False: System validation is an end-to-end process that ensures that the completed and integrated system will operate as needed in the environment for which it was intended.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which area is being tested when we test the failover capabilities of web, application, and database servers?",
      "c": [
         "Network architecture",
         "Business rules",
         "Performance",
         "System reliability"
      ],
      "a": [
         "System reliability"
      ]
   },
   {
      "q": "The data layer encapsulates data used by the application or that is collected from the end user.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Question 2 :True or False: Testing is the process of executing a program with the intent of finding errors.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which of the following is a debugging principle?",
      "c": [
         "Fix the symptom, not the error",
         "Change the object code, not the source code",
         "Where there is one bug, there is likely to be another",
         "The likelihood of a fix being correct is 100%"
      ],
      "a": [
         "Where there is one bug, there is likely to be another"
      ]
   },
   {
      "q": "Which human error detection process is considered relatively unproductive?",
      "c": [
         "Code walkthroughs",
         "Code inspections",
         "Peer ratings",
         "Desk checking"
      ],
      "a": [
         "Desk checking"
      ]
   },
   {
      "q": "When verifying the business layer of an application, which test will blast the application with multiple logins and simulate transactions to the point of failure?",
      "c": [
         "Performance testing",
         "Response time testing",
         "Data validation",
         "Transactional testing"
      ],
      "a": [
         "Performance testing"
      ]
   },
   {
      "q": "Is the following statement about mobile testing categories, true or false:<P>Device interaction: Ensures that application does not consume too much memory",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "In addition to finding errors, what else would a black-box tester look for when testing a program?",
      "c": [
         "Usability issues",
         "Stability issues",
         "Infrastructure issues",
         "Data issues"
      ],
      "a": [
         "Usability issues"
      ]
   },
   {
      "q": "Indicate if the given statements about agile testing is true or false.<P>It works well with extreme programming methodology whereby developers create unit tests and then the software.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the descriptions that match Peer Ratings",
      "c": [
         "Follows undisciplined process of testing and finding errors",
         "Selects a programmer to serve as the administrator of a process",
         "Evaluates anonymous programs for their overall quality, maintainability, and so on",
         "Runs counter to testing principle two, which states that people are generally ineffective in testing their own programs"
      ],
      "a": [
         "Evaluates anonymous programs for their overall quality, maintainability, and so on",
         "Selects a programmer to serve as the administrator of a process"
      ]
   },
   {
      "q": "Select the description that matches the Performance test case.",
      "c": [
         "Subjects the program to heavy loads of data",
         "Ensures functionality to be implemented in the objectives",
         "Determines how well an end user can interact with the program",
         "Checks if the program meets response and throughput requirements"
      ],
      "a": [
         "Checks if the program meets response and throughput requirements"
      ]
   },
   {
      "q": "Error analysis, focuses on judging the exact location of the error, the developer of code, the preventive measures taken to avoid those errors in future, and so on.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "True or False: A bug model is based on historical data and planned activities and predicts how many bugs will be found during the project.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Independently testing each internet application layer allows the tester to more easily identify bugs and errors.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "True or False: A bug model predicts how many bugs you should be tracking at any given time.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "A system test should be performed by the programmer and the organization responsible for developing the program.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Which approach gathers information and comments that can be counted and analyzed across the spectrum of testers?",
      "c": [
         "Test user selection",
         "User questionnaire",
         "Remote user testing",
         "Think-aloud process"
      ],
      "a": [
         "User questionnaire"
      ]
   },
   {
      "q": "Which two core disciplines intersect with business goals during black-box testing?",
      "c": [
         "Quality assurance and product management",
         "Quality assurance and development",
         "Quality assurance and Business management"
      ],
      "a": [
         "Quality assurance and product management"
      ]
   },
   {
      "q": "______ focuses on testing smaller units of the program first, rather than initially testing the whole program.",
      "c": [
         "Unit testing",
         "Module testing"
      ],
      "a": [
         "Module testing"
      ]
   },
   {
      "q": "Describe White-box testing",
      "c": [
         "Requires programming and implementation knowledge",
         "Exhaustive path testing is one of its type of testing technique",
         "Exhaustive input testing is one of its type of testing technique",
         "Internal structure or design implementation is not known to the tester"
      ],
      "a": [
         "Exhaustive path testing is one of its type of testing technique",
         "Requires programming and implementation knowledge"
      ]
   },
   {
      "q": "Is the following statement about the specifications for a debugging command, true or false. Lowercase letters represent operand values that are to be substituted.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which type of testing combines one module with a set of previously tested modules before it is tested?",
      "c": [
         "Non-incremental testing",
         "Logic testing",
         "Incremental testing",
         "Big-bang testing"
      ],
      "a": [
         "Incremental testing"
      ]
   },
   {
      "q": "Which testing challenge category is concerned with overcoming location-based obstacles?",
      "c": [
         "Usability",
         "Carrier network infrastructure",
         "Mobile device diversity",
         "Scripting"
      ],
      "a": [
         "Carrier network infrastructure"
      ]
   },
   {
      "q": "The presentation layer provides the user interface (or graphical user interface whichever is applicable",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Is the given statements about system testing is true or false. It is a process of testing the functions of the complete system or program.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Select the statements that match Bottom-up testing. (choose two)",
      "c": [
         "Creates test conditions and concludes test results easily",
         "Finds difficulty in test case representation in stubs, before the I/O function addition",
         "Conducts testing from sub module to main module",
         "Conducts testing from main module to sub module"
      ],
      "a": [
         "Conducts testing from sub module to main module",
         "Creates test conditions and concludes test results easily"
      ]
   },
   {
      "q": "Select the description that matches the e-commerce architecture tier for tier 2:",
      "c": [
         "Provides the visual content to the end user",
         "Runs the software to model user business processes",
         "Focuses on storing and retrieving data from the data source"
      ],
      "a": [
         "Runs the software to model user business processes"
      ]
   },
   {
      "q": "Debugging is a two-step process that begins with determination of the nature and location of the suspected error and then fixing it.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which agile methodology is an iterative and incremental project management approach that supports many other agile methodologies?",
      "c": [
         "Extreme Programming",
         "Agile Modeling",
         "Open Unified Process",
         "Scrum"
      ],
      "a": [
         "Scrum"
      ]
   },
   {
      "q": "It checks whether the parameter supplied causes the method to return an incorrect Boolean value.",
      "c": [
         "assertFalse()",
         "main()",
         "primeCheck()",
         "checkArgs()"
      ],
      "a": [
         "assertFalse()"
      ]
   },
   {
      "q": "Indicate if the given statements about agile testing is true or false.<P>It engages the customer as early as possible and throughout the development cycle.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Diversity devices: Contains many web browsers, run-time versions of Java or other languages, and so on",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which test category verifies that the application responds appropriately to a weak signal?",
      "c": [
         "Device interaction",
         "Network infrastructure",
         "Install/uninstall",
         "Key mappings"
      ],
      "a": [
         "Network infrastructure"
      ]
   },
   {
      "q": "Indicate if the given statements about error-locating principles is true or false.<P>Turn your attention to something else if you're trying from a very long time to solve a problem but failing continuously.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the components of a test case.",
      "c": [
         "A description of data processing information",
         "A description of the correct output of the program for that set of input data",
         "A description of the input data to the program",
         "A description of the type of testing technique used"
      ],
      "a": [
         "A description of the correct output of the program for that set of input data",
         "A description of the input data to the program"
      ]
   },
   {
      "q": "What is being verified when testing the business tier?",
      "c": [
         "The backend data entry and management routines",
         "That recovery can be done using current backups",
         "That transactions are completed properly",
         "That graphics are the correct size and resolution"
      ],
      "a": [
         "That transactions are completed properly"
      ]
   },
   {
      "q": "Each test-case design methodology is a particular set of useful test cases, and each one by itself is a thorough set of test cases.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Which logic coverage test will test all possible combinations of condition outcomes in each decision and all points of entry at least once?",
      "c": [
         "Decision coverage",
         "Condition coverage",
         "Statement coverage",
         "Multiple-condition coverage"
      ],
      "a": [
         "Multiple-condition coverage"
      ]
   },
   {
      "q": "Occurs when a variable has an unset or uninitialized value",
      "c": [
         "Interface",
         "Data reference",
         "Computation",
         "Data declaration",
         "Input/Output"
      ],
      "a": [
         "Data reference"
      ]
   },
   {
      "q": "What testing types would you conduct if you wanted to make sure (a) the website still performs and functions appropriately with the new code in place, and (b) the system can handle the additional user traffic and page loading needs?",
      "c": [
         "Unit testing",
         "System integration",
         "Acceptance testing",
         "Regression and performance testing"
      ],
      "a": [
         "Regression and performance testing"
      ]
   },
   {
      "q": "Is the given statements about testing with emulator is true or false:<P>It is efficient in identifying the nuances and bugs of each device.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Software development is the process of moving from the conceptual to the concrete.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "In a walkthrough the majority of program testing is conducted by the author of the program.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Which category on the inspection error checklist checks if files are explicitly declared and their attributes are correct?",
      "c": [
         "Data reference errors",
         "Control flow errors",
         "Interface errors",
         "Input/Output errors"
      ],
      "a": [
         "Input/Output errors"
      ]
   },
   {
      "q": "What can a developer employ to identify and resolve code quality issues?",
      "c": [
         "Unit testing",
         "Peer reviews",
         "Code-level tools",
         "Bug tracking systems"
      ],
      "a": [
         "Code-level tools"
      ]
   },
   {
      "q": "True or False: A close working partnership between IT and QA can result in greater efficiencies of process.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Installation and maintenance: Comprises of patching, upgrading, and so on",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the correct black box testing type. Tests extreme ends or boundaries between partitions of the input values.",
      "c": [
         "Boundary value analysis",
         "Cause-effect graphing",
         "Equivalence partitioning"
      ],
      "a": [
         "Boundary value analysis"
      ]
   },
   {
      "q": "Indicate if the following statement about Jakob Nielsen's usability research is true or false:<P>It cautions that the precise number of testers depends only on economic considerations by the user.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "What does agile testing rely on in order to facilitate the timely feedback needed for rapid development?",
      "c": [
         "Automated testing",
         "Requirement changes",
         "Small teams of developers",
         "Extreme Programming"
      ],
      "a": [
         "Automated testing"
      ]
   },
   {
      "q": "_____ testing involves testing random users for a software with a general target market.",
      "c": [
         "Agile",
         "Hallway intercept",
         "Remote usability"
      ],
      "a": [
         "Hallway intercept"
      ]
   },
   {
      "q": "True or False: Process improvement helps software development build and retain product and service quality.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "What is the main consideration for a usability test?",
      "c": [
         "The program meets all functionality requirements",
         "The program performs according to its specifications",
         "The program has no reported issues",
         "The program passes all module testing"
      ],
      "a": [
         "The program performs according to its specifications"
      ]
   },
   {
      "q": "Select the description that matches the testing challenge for an internet based application facing a business environment challenge.",
      "c": [
         "Includes protection of information such as customers' credit card from hackers",
         "Includes internationalization issues such as currency conversion",
         "Includes cost related issues and tracking customer profiles"
      ],
      "a": [
         "Includes cost related issues and tracking customer profiles"
      ]
   },
   {
      "q": "Is the following statement true or false.<P>Network infrastructure: Verifies that the application responds appropriately to weak signals",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which agile methodology includes the concept of collective ownership of the code?",
      "c": [
         "Extreme Programming",
         "Agile testing",
         "Scrum",
         "Open Unified Process"
      ],
      "a": [
         "Extreme Programming"
      ]
   },
   {
      "q": "What is a visual definition of how you will prioritize bugs as they are discovered?",
      "c": [
         "A PowerPoint presentastion",
         "A list of all bugs",
         "A matrix of severity versus stakeholder concerns",
         "A matrix of impacts versus severity"
      ],
      "a": [
         "A matrix of impacts versus severity"
      ]
   },
   {
      "q": "In a mobile environment, which term is used to describe something that has the capability to run a network-based application over a cellular or satellite data link?",
      "c": [
         "Input device",
         "Mobile application",
         "Device constraint",
         "Mobile device"
      ],
      "a": [
         "Mobile device"
      ]
   },
   {
      "q": "Select the descriptions that match Incremental testing",
      "c": [
         "Less machine time is involved (choose two)",
         "Incorrect assumption error among modules is detected earlier",
         "Every new module is first combined with already tested module sets",
         "Modules are tested independently and then combined to form a program"
      ],
      "a": [
         "Incorrect assumption error among modules is detected earlier",
         "Every new module is first combined with already tested module sets"
      ]
   },
   {
      "q": "Select the expected participants of a walkthrough team.",
      "c": [
         "Programming-language expert",
         "Highly experienced programmer",
         "Project quality analyst",
         "Person who will eventually maintain the program",
         "New programmer",
         "Someone from a different project"
      ],
      "a": [
         "Programming-language expert",
         "Highly experienced programmer",
         "Person who will eventually maintain the program",
         "New programmer",
         "Someone from a different project"
      ]
   },
   {
      "q": "Who should create automated unit tests?",
      "c": [
         "QA Engineer",
         "Automation tester",
         "White-box tester",
         "Program developer"
      ],
      "a": [
         "Program developer"
      ]
   },
   {
      "q": "Is the given statements about system testing is true or false. It involves testing of the user's experience with the application.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "States creation of enough test cases that each branch direction must be traversed at least once",
      "c": [
         "Descision/condition",
         "Multiple-Condition",
         "Decision",
         "Statement",
         "Condition"
      ],
      "a": [
         "Decision"
      ]
   },
   {
      "q": "It asserts that the input value is a positive integer.",
      "c": [
         "checkArgs()",
         "primeCheck()",
         "assertFalse()",
         "main()"
      ],
      "a": [
         "checkArgs()"
      ]
   },
   {
      "q": "Select the descriptions that match the Inspection error detection agenda (choose two)",
      "c": [
         "Focuses on quality improvement rather than attacking the programmer",
         "Investigates program with respect to checklist of historically common programming errors",
         "Focuses on error discovery, not error correction",
         "Recommends that the inspection results must be kept confidential"
      ],
      "a": [
         "Focuses on error discovery, not error correction",
         "Investigates program with respect to checklist of historically common programming errors"
      ]
   },
   {
      "q": "Select the drawbacks of the brute-force scattering method.",
      "c": [
         "It produces a massive amount of data to be analyzed.",
         "It encourages the user to think about the problem.",
         "It is feasible on operating systems and process control programs.",
         "It requires the user to change the program which can introduce new errors.",
         "It increases the cost when used in large programs.",
         "It is based on a hit-or-miss technique."
      ],
      "a": [
         "It produces a massive amount of data to be analyzed.",
         "It requires the user to change the program which can introduce new errors.",
         "It increases the cost when used in large programs.",
         "It is based on a hit-or-miss technique."
      ]
   },
   {
      "q": "Reflects the thought processes of an observer by analyzing the time an observer pauses on certain visual elements",
      "c": [
         "Eye tracking",
         "Think-aloud"
      ],
      "a": [
         "Eye tracking"
      ]
   },
   {
      "q": "Which type of testing includes the rule: \"All code modules must have unit tests before coding begins\"?",
      "c": [
         "Agile testing",
         "Unit testing",
         "Open Unified Process",
         "Extreme unit testing"
      ],
      "a": [
         "Extreme unit testing"
      ]
   },
   {
      "q": "How is a solid IT-QA relationship fundamental to business success?",
      "c": [
         "It provides a usability perspective for the business to understand",
         "It will help deliver compliant business-enabling systems",
         "It can lower cost by fixing issues early in the process",
         "It finds and fixes bugs before systems are delivered"
      ],
      "a": [
         "It will help deliver compliant business-enabling systems"
      ]
   },
   {
      "q": "Which Agile methodology matches this statement:<P>Attempts to measure the rate at which the development process is moving",
      "c": [
         "Essential unified process",
         "Feature driven development",
         "Velocity tracking",
         "Dynamic system development method"
      ],
      "a": [
         "Velocity tracking"
      ]
   },
   {
      "q": "Which role records all errors found in a code walkthrough?",
      "c": [
         "Programmer",
         "tester",
         "Moderator",
         "Secretary"
      ],
      "a": [
         "Secretary"
      ]
   },
   {
      "q": "Is the following statement true or false: <P>Exit: Confirms that the application meets design specifications when the user initiates a shutdown of device",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Connectivity: Includes device provisioning, network latency, service reliability, and so on",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the duties of an Inspection Team moderator",
      "c": [
         "Lead the session.",
         "Ensure that the errors are subsequently corrected.",
         "Distribute materials for the inspection session.",
         "Record all errors found.",
         "Schedule the inspection session.",
         "Make changes in the session."
      ],
      "a": [
         "Lead the session.",
         "Ensure that the errors are subsequently corrected.",
         "Distribute materials for the inspection session.",
         "Record all errors found.",
         "Schedule the inspection session."
      ]
   },
   {
      "q": "_____ testing tests the interactive software parts for reasonable selection and user feedback.",
      "c": [
         "Component",
         "Usability",
         "Module"
      ],
      "a": [
         "Component"
      ]
   },
   {
      "q": "Is the following question about inspections and walkthroughs in software testing, true or false.",
      "c": [
         "They are effective in detecting high-level design errors."
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "What is the intent of test automation?",
      "c": [
         "To optimize your process and make testing more efficient",
         "To find as many defects as possible",
         "To automatically record issues to be fixed",
         "To test as many pieces of functionality as possible"
      ],
      "a": [
         "To optimize your process and make testing more efficient"
      ]
   },
   {
      "q": "What is an advantage of bottom-up testing?",
      "c": [
         "Skeletal programs allow demonstrations",
         "Major flaws occur toward the top of the program",
         "Driver modules are produced",
         "Observation of test results is easier"
      ],
      "a": [
         "Observation of test results is easier"
      ]
   },
   {
      "q": "Module testing is a process of testing the individual subprograms, subroutines, classes, or procedures in a program.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "What makes a test run successful?",
      "c": [
         "A test that discovers a new error",
         "A test that did not find any errors",
         "A test that demonstrates all functionality of the program",
         "A test that causes the program to produce the correct result"
      ],
      "a": [
         "A test that discovers a new error"
      ]
   },
   {
      "q": "Is the following question about inspections and walkthroughs in software testing, true or false.<P>They are code-oriented human testing methods.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Device constraints: Includes screen, data cache sizes, memory limit, and so on",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "What can be achieved with a process improvement initiative based on the CMMI?",
      "c": [
         "A sense of when a project is done",
         "An approach to monitoring employees",
         "A measurable business result",
         "A way to evaluate customers"
      ],
      "a": [
         "A measurable business result"
      ]
   },
   {
      "q": "Selecting random users—persons who are not familiar with the program's specification, or perhaps even the industry or market for which it is intended—can uncover errors or user interface problems that might not be found by experts.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Is the following statement about the specifications for a debugging command, true or false. Underlined operands represent the values used when the operand is omitted.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "True or False: Bugs that are found and fixed early in the process will cost more to fix when compared to finding them later and fixing all the bugs at once.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "When verifying an internet application, testing browser compatibility is a significant challenge.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Is the given statements about testing with emulator is true or false: <P> It allows inexpensive and quick functional testing of an application.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Is the following question about inspections and walkthroughs in software testing, true or false.<P>They are an improvement over the older desk-checking process.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Identify the testing processes that make up the Integration test part of the development phase",
      "c": [
         "System design: It lays down the design principles of the system.",
         "Requirement: It specifies the cause of the program.",
         "Code: It produces the code for the required program.",
         "External specification: It defines the exact representation of the program to users."
      ],
      "a": [
         "System design: It lays down the design principles of the system."
      ]
   },
   {
      "q": "Select the descriptions that match the Human error detection agenda (choose two)",
      "c": [
         "Focuses on quality improvement rather than attacking the programmer",
         "Investigates program with respect to checklist of historically common programming errors",
         "Focuses on error discovery, not error correction",
         "Recommends that the inspection results must be kept confidential"
      ],
      "a": [
         "Recommends that the inspection results must be kept confidential",
         "Focuses on quality improvement rather than attacking the programmer"
      ]
   },
   {
      "q": "Select the description that matches the Volume test case.",
      "c": [
         "Subjects the program to heavy loads of data",
         "Ensures functionality to be implemented in the objectives",
         "Checks if the program meets response and throughput requirements",
         "Determines how well an end user can interact with the program"
      ],
      "a": [
         "Subjects the program to heavy loads of data"
      ]
   },
   {
      "q": "Is the given statements about system testing is true or false. It focuses on translation errors made during the designing of external specification.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "What plays a major role in whether users accept or reject an application?",
      "c": [
         "Transactions that roll back correctly",
         "Fonts, colors, and graphics",
         "Database operations that meet performance goals",
         "Consistent and user-friendly operations"
      ],
      "a": [
         "Fonts, colors, and graphics"
      ]
   },
   {
      "q": "Which element of a bug record will provide the programmer with a visual representation of the problem?",
      "c": [
         "A description of expected versus actual results",
         "The steps to recreate the problem",
         "A screenshot",
         "A brief and accurate description"
      ],
      "a": [
         "A screenshot"
      ]
   },
   {
      "q": "Indicate if the following statement about Jakob Nielsen's usability research is true or false:<P>It states that it is impossible to detect all of the usability errors in the application.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which agile method is being used when the programmer designs an application to pass the unit tests, therefore increasing the probability that it will meet specifications?",
      "c": [
         "Extreme unit testing",
         "Open Unified Process",
         "Scrum",
         "Extreme Programming"
      ],
      "a": [
         "Extreme Programming"
      ]
   },
   {
      "q": "Indicate if given statement about presentation layer testing is true or false: <P> It comprises of two major areas, namely content testing and user environment.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Select the correct black box testing type. Divides the input domain of a program into a finite number of classes and then identifies the test cases",
      "c": [
         "Equivalence partitioning",
         "Cause-effect graphing",
         "Boundary value analysis"
      ],
      "a": [
         "Equivalence partitioning"
      ]
   },
   {
      "q": "When testing a mobile application on a real device, manual testing is unavoidable.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "True or False: Studies have shown that defects found and fixed in the requirements phase carry the highest cost.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Question :What information on the bug record establishes why the result was flagged as a problem?",
      "c": [
         "What was expected vs. what actually happened",
         "The browser/operating system being used",
         "Steps to take to repeat the problem",
         "The problem description"
      ],
      "a": [
         "What was expected vs. what actually happened"
      ]
   },
   {
      "q": "Which type of review is considered a walkthrough?",
      "c": [
         "Progress review",
         "Management review",
         "Peer review",
         "Milestone review"
      ],
      "a": [
         "Peer review"
      ]
   },
   {
      "q": "The most effective method of debugging involves a mental process.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which Agile methodology matches this statement:<P>Uses industry best practices, such as regular builds, domain object modeling, and feature teams",
      "c": [
         "Feature driven development",
         "Essential unified process",
         "Velocity tracking",
         "Dynamic system development method"
      ],
      "a": [
         "Feature driven development"
      ]
   },
   {
      "q": "Arises when a variable is not assigned with correct length or data type",
      "c": [
         "Interface",
         "Data reference",
         "Computation",
         "Data declaration",
         "Input/Output"
      ],
      "a": [
         "Data declaration"
      ]
   },
   {
      "q": "What does the specification for a module typically define?",
      "c": [
         "Input/Output parameters",
         "Logic coverage",
         "Multi-condition criterion",
         "Coverage criterion"
      ],
      "a": [
         "Input/Output parameters"
      ]
   },
   {
      "q": "Ensures the highest level of software efficiency in the user input data",
      "c": [
         "Think-aloud",
         "Eye tracking"
      ],
      "a": [
         "Eye tracking"
      ]
   },
   {
      "q": "What type of test is a module test?",
      "c": [
         "Functionality",
         "White-box",
         "Regression",
         "Black-box"
      ],
      "a": [
         "White-box"
      ]
   },
   {
      "q": "Identify the testing processes that make up the Installation test part of the development phase",
      "c": [
         "External specification: It defines the exact representation of the program to users.",
         "System design: It lays down the design principles of the system.",
         "Requirement: It specifies the cause of the program.",
         "Code: It produces the code for the required program."
      ],
      "a": [
         "Code: It produces the code for the required program."
      ]
   },
   {
      "q": "Which software testing principle states that a programmer may subconsciously avoid finding errors for fear of retribution from peers, a supervisor, a client, or the owner of the program or system being developed?",
      "c": [
         "Any testing process should include a thorough inspection of the results of each test.",
         "Do not plan a testing effort under the tacit assumption that no errors will be found.",
         "A programmer should avoid attempting to test his or her own program.",
         "A programming organization should not test its own programs."
      ],
      "a": [
         "A programmer should avoid attempting to test his or her own program."
      ]
   },
   {
      "q": "Is the following statement about the specifications for a debugging command, true or false. Capital letters represent operands operations.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Based on the work of Jakob Nielsen, how many testers will collectively find 83 percent of errors during a usability test?",
      "c": [
         "5",
         "2",
         "1",
         "10"
      ],
      "a": [
         "5"
      ]
   },
   {
      "q": "Cause-effect graphing is a systematic method of generating test cases representing an ad hoc set of conditions.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Indicate if given statement about presentation layer testing is true or false<P>It tests the website architecture to find navigational and structural errors.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Which debugging method moves from the particulars of a situation to the larger picture?",
      "c": [
         "Error-locating principles",
         "Debugging by induction",
         "Debugging by deduction",
         "Brute-force debugging"
      ],
      "a": [
         "Debugging by induction"
      ]
   },
   {
      "q": "Indicate if the given statements about agile testing is true or false.<P>It involves everyone in the process through design, implementation, and execution of the test plans.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the correct description of the appropriate testing tiers for the data layer",
      "c": [
         "Verifies that graphics have the correct resolution and size.",
         "Verifies that the data is stored correctly and accurately.",
         "Ensures that data is collected correctly."
      ],
      "a": [
         "Verifies that the data is stored correctly and accurately."
      ]
   },
   {
      "q": "Involves users speaking out their ideas and observations while they are performing the assigned software testing tasks",
      "c": [
         "Think-aloud",
         "Eye tracking"
      ],
      "a": [
         "Think-aloud"
      ]
   },
   {
      "q": "Why is a code inspection more effective than a desk-checking process?",
      "c": [
         "Because it is effective in finding high-level design errors",
         "Because it finds difficult, obscure, and tricky errors",
         "Because the author of the program is personally checking the code",
         "Because people other than the author are involved in the process"
      ],
      "a": [
         "Because people other than the author are involved in the process"
      ]
   },
   {
      "q": "User-based testing requires the user to know the inner workings of a program.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Is the following statement about the specifications for a debugging command, true or false. Brackets represent alternative optional operands.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the descriptions that match Non-incremental testing (choose two)",
      "c": [
         "Every new module is first combined with already tested module sets",
         "Incorrect assumption error among modules is detected earlier",
         "Less machine time is involved",
         "Modules are tested independently and then combined to form a program"
      ],
      "a": [
         "Less machine time is involved",
         "Modules are tested independently and then combined to form a program"
      ]
   },
   {
      "q": "Is the following question about inspections and walkthroughs in software testing, true or false.<P>They involve a team of people reading or visually inspecting a program.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Is the following statement about mobile testing categories, true or false: Low memory: Ensures application stability in low storage situation",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the steps in the inductive debugging process",
      "c": [
         "Devise a hypothesis",
         "Study their relationships",
         "Locate the pertinent data",
         "Prove the hypothesis",
         "Organize the data",
         "Fix the error"
      ],
      "a": [
         "Locate the pertinent data",
         "Organize the data",
         "Study their relationships",
         "Devise a hypothesis",
         "Prove the hypothesis",
         "Fix the error"
      ]
   },
   {
      "q": "Identify the testing processes that make up the Acceptance test part of the development phase",
      "c": [
         "External specification: It defines the exact representation of the program to users.",
         "Requirement: It specifies the cause of the program.",
         "System design: It lays down the design principles of the system.",
         "Code: It produces the code for the required program."
      ],
      "a": [
         "Requirement: It specifies the cause of the program."
      ]
   },
   {
      "q": "Usability testing is a black-box testing techniques.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Acceptance testing is the process of comparing the program to its initial requirements and the current needs of its end users",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "When is a good time to start automation testing?",
      "c": [
         "When you begin coding, so that the automation tests can be done ahead of time",
         "At the end of the project, right before the user starts acceptance testing",
         "When you are confident that you do not want anything to change in the code",
         "When the scheduled milestone for automation testing is reached"
      ],
      "a": [
         "When you are confident that you do not want anything to change in the code"
      ]
   },
   {
      "q": "How is quality defined in Extreme Programming?",
      "c": [
         "Testing the code base once",
         "Implementation of complicated designs",
         "Good communication between developers and testers",
         "Meeting design specifications and customer expectations"
      ],
      "a": [
         "Meeting design specifications and customer expectations"
      ]
   },
   {
      "q": "True or False: Providing clearly defined goals for each step in the development cycle is a quality best practice.",
      "c": [
         "True",
         "False"
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Select the statements that match the testing approach for an emulator. (choose two)",
      "c": [
         "Tests carriers' network responsiveness",
         "Skews performance on real device due to underlying hardware",
         "Supports multiple devices with a single unit",
         "Tests responsiveness of the application"
      ],
      "a": [
         "Skews performance on real device due to underlying hardware",
         "Supports multiple devices with a single unit"
      ]
   },
   {
      "q": "Which statement matches the performance section of the business layer testing area.",
      "c": [
         "Tests whether the application meets documented operational specifications",
         "Tests to uncover errors in transaction processing, such as credit card processing, e-mailing verifications, and so on",
         "Tests to detect errors in knowledge collected from customers"
      ],
      "a": [
         "Tests whether the application meets documented operational specifications"
      ]
   },
   {
      "q": "Select the targets of extreme programming. (choose four)",
      "c": [
         "Implementation of simple designs",
         "Seek project team feedback",
         "Communication between developers and testers",
         "Continuous testing of the code base",
         "Communication between developers and customers",
         "Accommodate specification changes"
      ],
      "a": [
         "Implementation of simple designs",
         "Continuous testing of the code base",
         "Communication between developers and customers",
         "Accommodate specification changes"
      ]
   },
   {
      "q": "Select the statements that match the Testing debugging method. (choose one)",
      "c": [
         "It starts from the suspected site, and then traces in opposite direction in entire source code.",
         "It is effective in case of small applications.",
         "It provides information useful in locating a suspected error."
      ],
      "a": [
         "It provides information useful in locating a suspected error."
      ]
   },
   {
      "q": "Indicate if the given statement about exhaustive path testing is true or false.",
      "c": [
         "It states that all the possible paths of control flow are tested through the program."
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Indicate if the given statement about exhaustive path testing is true or false.",
      "c": [
         "It does not guarantee that a program matches its specification."
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Indicate if the given statement about exhaustive path testing is true or false.",
      "c": [
         "It detects the absence of necessary paths within a program, if found missing."
      ],
      "a": [
         "False"
      ]
   },
   {
      "q": "Indicate if the given statement about exhaustive path testing is true or false.",
      "c": [
         "It is inferior to exhaustive input testing."
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Indicate if the given statement about usability testing is true or false.",
      "c": [
         "It is a black-box testing technique."
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Indicate if the given statement about usability testing is true or false.",
      "c": [
         "It involves actual users or customers of the product."
      ],
      "a": [
         "True"
      ]
   },
   {
      "q": "Indicate if the given statement about usability testing is true or false.",
      "c": [
         "It is also called user acceptance testing."
      ],
      "a": [
         "False"
      ]
   }
]
